# ProgressDlgSetTopMsg

## Description
Set top message of a progress dialog.

```pascal
PROCEDURE ProgressDlgSetTopMsg(message : STRING);
```

```python
def vs.ProgressDlgSetTopMsg(message):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|STRING|   |

## Examples
les can be found at [[VS:Progress Dialog]].

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYeld

## Version
Availability: from Vectorworks 2015

## Category
* Utility